controllers/UserController.php

INSERT INTO `user` (`login`, `password`, `access_token`, `auth_key`, `name`, `email`, `phone`, `firm_id`, `workplace_id`, `note`, `rec_status_id`, `user_id`, `dc`) VALUES ('manager_c', '8f777f0c1c92b352343276717505c51e', '', '', 'manager_c', NULL, 'fillingbase', NULL, NULL, NULL, 1, 1, NULL)
---
    public function actionCreate()
    {
        $model = new User();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {