models/queries/RecStatusQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `rec_status` WHERE `rec_status_id`=1