models/queries/ResumeProfessionQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `resume_profession` WHERE `resume_id` IN (1, 2)