models/Person.php

SELECT COUNT(*) FROM `doc_medical` WHERE `person_id`=1
SELECT COUNT(*) FROM `doc_inn` WHERE `person_id`=1
SELECT COUNT(*) FROM `doc_patent` WHERE `person_id`=1
SELECT COUNT(*) FROM `doc_exam` WHERE `person_id`=1
SELECT COUNT(*) FROM `doc_migration` WHERE `person_id`=1
SELECT COUNT(*) FROM `doc_registration` WHERE `person_id`=1
---
    public function getDocsCount()
    {
        return $this->getPasport()->count()
        + $this->getMedical()->count()
        + $this->getInn()->count()
        + $this->getPatent()->count()
        + $this->getExam()->count()
        + $this->getMigration()->count()
        + $this->getRegistration()->count()